test-suites/jmeter/product/iam/Stress_Test_IAM.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="3.2" jmeter="3.2 r1790748">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Stress_Test_IAM" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <kg.apc.jmeter.threads.SteppingThreadGroup guiclass="kg.apc.jmeter.threads.SteppingThreadGroupGui" testclass="kg.apc.jmeter.threads.SteppingThreadGroup" testname="jp@gc - Stepping Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <stringProp name="ThreadGroup.num_threads">100</stringProp>
        <stringProp name="Threads initial delay">0</stringProp>
        <stringProp name="Start users count">10</stringProp>
        <stringProp name="Start users count burst">0</stringProp>
        <stringProp name="Start users period">1</stringProp>
        <stringProp name="Stop users count">1</stringProp>
        <stringProp name="Stop users period">1</stringProp>
        <stringProp name="flighttime">60</stringProp>
        <stringProp name="rampUp">10</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
      </kg.apc.jmeter.threads.SteppingThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Create IDP" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">&lt;soapenv:Envelope xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:mgt=&quot;http://mgt.idp.carbon.wso2.org&quot; xmlns:xsd=&quot;http://model.common.application.identity.carbon.wso2.org/xsd&quot;&gt;&#xd;
   &lt;soapenv:Header/&gt;&#xd;
   &lt;soapenv:Body&gt;&#xd;
      &lt;mgt:addIdP&gt;&#xd;
         &lt;mgt:identityProvider&gt;&#xd;
            &lt;xsd:alias&gt;https://localhost:9443/oauth2/token&lt;/xsd:alias&gt;&#xd;
            &lt;xsd:certificate&gt;&lt;/xsd:certificate&gt;&#xd;
&#xd;
&#xd;
	    &lt;defaultAuthenticatorConfig xmlns=&quot;http://model.common.application.identity.carbon.wso2.org/xsd&quot;&gt;&#xd;
               &lt;displayName&gt;samlsso&lt;/displayName&gt;&#xd;
               &lt;enabled&gt;true&lt;/enabled&gt;&#xd;
               &lt;name&gt;SAMLSSOAuthenticator&lt;/name&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;IdPEntityId&lt;/name&gt;&#xd;
                  &lt;value&gt;FederationHubIdP&lt;/value&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;SPEntityId&lt;/name&gt;&#xd;
                  &lt;value&gt;fed-proxy&lt;/value&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;SSOUrl&lt;/name&gt;&#xd;
                  &lt;value&gt;https://${federation_hub_is_host}:${federation_hub_is_port}/samlsso&lt;/value&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;ISAuthnReqSigned&lt;/name&gt;&#xd;
                  &lt;value&gt;false&lt;/value&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;IsLogoutEnabled&lt;/name&gt;&#xd;
                  &lt;value&gt;false&lt;/value&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;LogoutReqUrl&lt;/name&gt;&#xd;
                  &lt;value xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; xsi:nil=&quot;1&quot; /&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;IsLogoutReqSigned&lt;/name&gt;&#xd;
                  &lt;value&gt;false&lt;/value&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;IsAuthnRespSigned&lt;/name&gt;&#xd;
                  &lt;value&gt;false&lt;/value&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;IsUserIdInClaims&lt;/name&gt;&#xd;
                  &lt;value&gt;false&lt;/value&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;IsAssertionEncrypted&lt;/name&gt;&#xd;
                  &lt;value&gt;false&lt;/value&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;isAssertionSigned&lt;/name&gt;&#xd;
                  &lt;value&gt;false&lt;/value&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;commonAuthQueryParams&lt;/name&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;RequestMethod&lt;/name&gt;&#xd;
                  &lt;value&gt;redirect&lt;/value&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;SignatureAlgorithm&lt;/name&gt;&#xd;
                  &lt;value xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; xsi:nil=&quot;1&quot; /&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;DigestAlgorithm&lt;/name&gt;&#xd;
                  &lt;value xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; xsi:nil=&quot;1&quot; /&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;AuthnContextComparisonLevel&lt;/name&gt;&#xd;
                  &lt;value&gt;Exact&lt;/value&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;IncludeNameIDPolicy&lt;/name&gt;&#xd;
                  &lt;value&gt;false&lt;/value&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;ForceAuthentication&lt;/name&gt;&#xd;
                  &lt;value&gt;as_request&lt;/value&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;SignatureAlgorithmPost&lt;/name&gt;&#xd;
                  &lt;value xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; xsi:nil=&quot;1&quot; /&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;AuthnContextClassRef&lt;/name&gt;&#xd;
                  &lt;value&gt;Password Protected Transport&lt;/value&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;AttributeConsumingServiceIndex&lt;/name&gt;&#xd;
                  &lt;value xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; xsi:nil=&quot;1&quot; /&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;IncludeCert&lt;/name&gt;&#xd;
                  &lt;value&gt;false&lt;/value&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;IncludeAuthnContext&lt;/name&gt;&#xd;
                  &lt;value&gt;yes&lt;/value&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;IncludeProtocolBinding&lt;/name&gt;&#xd;
                  &lt;value&gt;false&lt;/value&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;meta_data_saml&lt;/name&gt;&#xd;
                  &lt;value xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; xsi:nil=&quot;1&quot; /&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;ResponseAuthnContextClassRef&lt;/name&gt;&#xd;
                  &lt;value&gt;default&lt;/value&gt;&#xd;
               &lt;/properties&gt;&#xd;
            &lt;/defaultAuthenticatorConfig&gt;&#xd;
&#xd;
&#xd;
            &lt;federatedAuthenticatorConfigs xmlns=&quot;http://model.common.application.identity.carbon.wso2.org/xsd&quot;&gt;&#xd;
               &lt;displayName&gt;samlsso&lt;/displayName&gt;&#xd;
               &lt;enabled&gt;true&lt;/enabled&gt;&#xd;
               &lt;name&gt;SAMLSSOAuthenticator&lt;/name&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;IdPEntityId&lt;/name&gt;&#xd;
                  &lt;value&gt;FederationHubIdP&lt;/value&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;SPEntityId&lt;/name&gt;&#xd;
                  &lt;value&gt;fed-proxy&lt;/value&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;SSOUrl&lt;/name&gt;&#xd;
                  &lt;value&gt;https://${federation_hub_is_host}:${federation_hub_is_port}/samlsso&lt;/value&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;ISAuthnReqSigned&lt;/name&gt;&#xd;
                  &lt;value&gt;false&lt;/value&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;IsLogoutEnabled&lt;/name&gt;&#xd;
                  &lt;value&gt;false&lt;/value&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;LogoutReqUrl&lt;/name&gt;&#xd;
                  &lt;value xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; xsi:nil=&quot;1&quot; /&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;IsLogoutReqSigned&lt;/name&gt;&#xd;
                  &lt;value&gt;false&lt;/value&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;IsAuthnRespSigned&lt;/name&gt;&#xd;
                  &lt;value&gt;false&lt;/value&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;IsUserIdInClaims&lt;/name&gt;&#xd;
                  &lt;value&gt;false&lt;/value&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;IsAssertionEncrypted&lt;/name&gt;&#xd;
                  &lt;value&gt;false&lt;/value&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;isAssertionSigned&lt;/name&gt;&#xd;
                  &lt;value&gt;false&lt;/value&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;commonAuthQueryParams&lt;/name&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;RequestMethod&lt;/name&gt;&#xd;
                  &lt;value&gt;redirect&lt;/value&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;SignatureAlgorithm&lt;/name&gt;&#xd;
                  &lt;value xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; xsi:nil=&quot;1&quot; /&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;DigestAlgorithm&lt;/name&gt;&#xd;
                  &lt;value xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; xsi:nil=&quot;1&quot; /&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;AuthnContextComparisonLevel&lt;/name&gt;&#xd;
                  &lt;value&gt;Exact&lt;/value&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;IncludeNameIDPolicy&lt;/name&gt;&#xd;
                  &lt;value&gt;false&lt;/value&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;ForceAuthentication&lt;/name&gt;&#xd;
                  &lt;value&gt;as_request&lt;/value&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;SignatureAlgorithmPost&lt;/name&gt;&#xd;
                  &lt;value xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; xsi:nil=&quot;1&quot; /&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;AuthnContextClassRef&lt;/name&gt;&#xd;
                  &lt;value&gt;Password Protected Transport&lt;/value&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;AttributeConsumingServiceIndex&lt;/name&gt;&#xd;
                  &lt;value xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; xsi:nil=&quot;1&quot; /&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;IncludeCert&lt;/name&gt;&#xd;
                  &lt;value&gt;false&lt;/value&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;IncludeAuthnContext&lt;/name&gt;&#xd;
                  &lt;value&gt;yes&lt;/value&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;IncludeProtocolBinding&lt;/name&gt;&#xd;
                  &lt;value&gt;false&lt;/value&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;meta_data_saml&lt;/name&gt;&#xd;
                  &lt;value xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; xsi:nil=&quot;1&quot; /&gt;&#xd;
               &lt;/properties&gt;&#xd;
               &lt;properties&gt;&#xd;
                  &lt;name&gt;ResponseAuthnContextClassRef&lt;/name&gt;&#xd;
                  &lt;value&gt;default&lt;/value&gt;&#xd;
               &lt;/properties&gt;&#xd;
            &lt;/federatedAuthenticatorConfigs&gt;&#xd;
            &lt;xsd:federationHub&gt;true&lt;/xsd:federationHub&gt;&#xd;
            &lt;xsd:homeRealmId&gt;-&lt;/xsd:homeRealmId&gt;&#xd;
            &lt;xsd:identityProviderDescription&gt;This IdP was added with SOAP-UI&lt;/xsd:identityProviderDescription&gt;&#xd;
            &lt;xsd:identityProviderName&gt;FederationHubIdP${count}&lt;/xsd:identityProviderName&gt;&#xd;
         &lt;/mgt:identityProvider&gt;&#xd;
      &lt;/mgt:addIdP&gt;&#xd;
   &lt;/soapenv:Body&gt;&#xd;
&lt;/soapenv:Envelope&gt;</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${is_host}</stringProp>
          <stringProp name="HTTPSampler.port">${federation_proxy_is_port}</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">utf-8</stringProp>
          <stringProp name="HTTPSampler.path">/services/IdentityProviderMgtService</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">SOAPAction</stringProp>
                <stringProp name="Header.value">urn:addIdP</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Basic ${adminCredentials}</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">text/xml</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <CounterConfig guiclass="CounterConfigGui" testclass="CounterConfig" testname="Counter" enabled="true">
          <stringProp name="CounterConfig.start">1</stringProp>
          <stringProp name="CounterConfig.incr">1</stringProp>
          <stringProp name="CounterConfig.name">id</stringProp>
          <stringProp name="CounterConfig.format">#</stringProp>
          <boolProp name="CounterConfig.per_user">false</boolProp>
        </CounterConfig>
        <hashTree/>
      </hashTree>
    </hashTree>
    <WorkBench guiclass="WorkBenchGui" testclass="WorkBench" testname="WorkBench" enabled="true">
      <boolProp name="WorkBench.save">true</boolProp>
    </WorkBench>
    <hashTree/>
  </hashTree>
</jmeterTestPlan>